app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "id"."id" = '2' LIMIT 1
---
  def show
    @artist = Artist.find_by_id(id: params[:id])